namespace INGMeter.Core;

public static class PartyTracker
{
	public static string GetAion2ServerName(int serverId)
	{
		return serverId switch
		{
			1001 => "시엘", 
			1002 => "네자칸", 
			1003 => "바이젤", 
			1004 => "카이시넬", 
			1005 => "유스티엘", 
			1006 => "아리엘", 
			1007 => "프레기온", 
			1008 => "메스람타에다", 
			1009 => "히타니에", 
			1010 => "나니아", 
			1011 => "타하바타", 
			1012 => "루터스", 
			1013 => "페르노스", 
			1014 => "다미누", 
			1015 => "카사카", 
			1016 => "바카르마", 
			1017 => "챈가룽", 
			1018 => "코치룽", 
			1019 => "이슈타르", 
			1020 => "티아마트", 
			1021 => "포에타", 
			2001 => "이스라펠", 
			2002 => "지켈", 
			2003 => "트리니엘", 
			2004 => "루미엘", 
			2005 => "마르쿠탄", 
			2006 => "아스펠", 
			2007 => "에레슈키갈", 
			2008 => "브리트라", 
			2009 => "네몬", 
			2010 => "하달", 
			2011 => "루드라", 
			2012 => "울고른", 
			2013 => "무닌", 
			2014 => "오다르", 
			2015 => "젠카카", 
			2016 => "크로메데", 
			2017 => "콰이링", 
			2018 => "바바룽", 
			2019 => "파프니르", 
			2020 => "인드나흐", 
			2021 => "이스할겐", 
			_ => "", 
		};
	}

	public static int GetAion2ServerId(string? serverName)
	{
		if (string.IsNullOrEmpty(serverName))
		{
			return 0;
		}
		return serverName switch
		{
			"시엘" => 1001, 
			"네자칸" => 1002, 
			"바이젤" => 1003, 
			"카이시넬" => 1004, 
			"유스티엘" => 1005, 
			"아리엘" => 1006, 
			"프레기온" => 1007, 
			"메스람타에다" => 1008, 
			"히타니에" => 1009, 
			"나니아" => 1010, 
			"타하바타" => 1011, 
			"루터스" => 1012, 
			"페르노스" => 1013, 
			"다미누" => 1014, 
			"카사카" => 1015, 
			"바카르마" => 1016, 
			"챈가룽" => 1017, 
			"코치룽" => 1018, 
			"이슈타르" => 1019, 
			"티아마트" => 1020, 
			"포에타" => 1021, 
			"이스라펠" => 2001, 
			"지켈" => 2002, 
			"트리니엘" => 2003, 
			"루미엘" => 2004, 
			"마르쿠탄" => 2005, 
			"아스펠" => 2006, 
			"에레슈키갈" => 2007, 
			"브리트라" => 2008, 
			"네몬" => 2009, 
			"하달" => 2010, 
			"루드라" => 2011, 
			"울고른" => 2012, 
			"무닌" => 2013, 
			"오다르" => 2014, 
			"젠카카" => 2015, 
			"크로메데" => 2016, 
			"콰이링" => 2017, 
			"바바룽" => 2018, 
			"파프니르" => 2019, 
			"인드나흐" => 2020, 
			"이스할겐" => 2021, 
			_ => 0, 
		};
	}
}
